import Header from "../Sections/Header";
import Footer from "../Sections/Footer";
import Heading from "../Components/Heading";
import InfoBox from "../Components/InfoBox";

const rules = {
  "১": {
    r: "ক্যাম্পাস বাসে ভ্রমণ সুবিধা শুধুমাত্র চট্টগ্রাম পলিটেকনিক ইন্সটিটিউট এর বর্তমান শিক্ষার্থী, শিক্ষক ও কর্মচারীদের জন্য প্রযোজ্য। এই ব্যতীত কেউ বাসে ভ্রমণ নিষিদ্ধ। ক্যাম্পাস বহির্ভূত কাউকে ভ্রমণ করতে দেখা গেলে তা সরাসরি শাস্তির আওতাভুক্ত করা হবে। শিক্ষার্থীর সাথে একজন রক্ত সম্পর্কীয় অভিভাবক ভ্রমণ করতে পারবে।",
    color: "bg-orange-600",
  },
  "২": {
    r: "ক্যাম্পাসে বাসে চড়তে হলে শিক্ষার্থীকে অবশ্যই পূর্ণ ক্যাম্পাস ইউনিফর্ম পরিধান করতে হবে এবং ক্যাম্পাসের আইডি কার্ড সঙ্গে রাখতে হবে। তবে, ১ম সেমিস্টারের যেসকল শিক্ষার্থী আইডি কার্ড পায়নি, তারা স্ব স্ব টেকনোলজীর চিফ ইন্সট্রাকটর কর্তৃক স্বাক্ষরিত অনুমতিপত্র ব্যবহার করে বাসে ভ্রমণ করতে পারবে।",
    color: "bg-purple-800",
  },
  "৩": {
    r: "বাসে ভ্রমণকালীন সময়ে কোন অবস্থাতেই বাসের চালক কিংবা চালকের সহকারীর সাথে খারাপ বা অশালীন আচরণ করা যাবে না। যদি তাদের পক্ষ থেকে কোন অনিয়ম দেখা যায়, তা সরাসরি ক্যাম্পাস কর্তৃপক্ষকে জানানোর অনুরোধ করা যাচ্ছে।",
    color: "bg-green-500",
  },
  "৪": {
    r: "ক্যাম্পাস বাস সম্পর্কিত কোন প্রকার ফি গ্রহণ বা আর্থিক লেনদেন করা হয় না। কারো সাথে কোন প্রকার আর্থিক লেনদেন করা থেকে বিরত থাকুন এবং কেউ করতে চাইলে তার সম্পর্কে সরাসরি অভিযোগ জানান কর্তৃপক্ষের কাছে।",
    color: "bg-blue-700",
  },
  "৫": {
    r: "বাসসমূহ সকল রুট পেইজে বর্ণিত প্রত্যেকটি স্টপগুলোতে শুধুমাত্র ৫ মিনিটের জন্য অপেক্ষা করবে। তাই স্ব স্ব স্টপের বাস ট্র্যাক করে সময়ানুবর্তি হয়ে স্টপে উপস্থিত থাকতে হবে।",
    color: "bg-pink-600",
  },
  "৬": {
    r: "বাসে কারো হারানো কোন প্রকার সম্পদ পেলে তা ক্যাম্পাসে কর্তৃপক্ষের কাছে জমা দেওয়ার অনুরোধ করা যাচ্ছে। যদি নিজের কোন জিনিস হারিয়ে গিয়ে থাকে, তাহলে যথাপোযুক্ত প্রমাণ দিয়ে ক্যাম্পাস থেকে সংগ্রহ করতে হবে। কোন সম্পদ ৬০ কর্মদিবসের মধ্যে সংগ্রহ করা না হলে, তার দায়িত্ব ক্যাম্পাস কর্তৃপক্ষ নিবে না।",
    color: "bg-amber-400",
  },
  "৭": {
    r: "সকল বাস জিপিএস ট্র্যাকার এবং সিসি ক্যামেরার সাহায্যে সার্বক্ষণিক নজরে রাখা হচ্ছে। তাই বাসে ভ্রমণকালীন ক্যাম্পাস কিংবা ট্রাফিক আইন ভঙ্গকারী কোন কার্যক্রম করা যাবে না।",
    color: "bg-red-700",
  },
};

export default function Rules() {
  return (
    <>
      <div className="flex flex-col min-h-screen">
        <Header />
        <main className="grow pb-8 px-10">
          <Heading
            text="বাস ব্যবহারের"
            maintext="নিয়মাবলি"
            subtext="ক্যাম্পাস বাস ব্যবহারের সময় সকল শিক্ষার্থীর জন্য যেসকল নিয়ম মেনে চলা
        আবশ্যক"
          />
          <section className="flex flex-col items-center justify-center">
            <div className="flex flex-col items-center justify-center md:px-12 gap-4">
              {Object.keys(rules).map((key) => {
                const data = rules[key];
                return (
                  <InfoBox
                    num={key}
                    details={data.r}
                    color={data.color}
                  />
                );
              })}
            </div>
          </section>
        </main>
        <Footer />
      </div>
    </>
  );
}
